Repository: BoxMars/PicImpact
Catalog: ios/大福映画/Resources/Localizable.xcstrings
Source language: zh
Languages: en, ja, zh_tw

# Preferences.adminImagesPerPage
source: 管理界面每页显示图片数量
en: Admin Images Per Page
ja: 管理画面の1ページあたりの画像表示数
zh_tw: 管理介面每頁顯示圖片數量

# Preferences.customIndexDownloadEnable
source: 下载按钮显示
en: Show Download Button
ja: ダウンロードボタンを表示
zh_tw: 下載按鈕顯示

# Preferences.customIndexOriginEnable
source: 首页是否显示原图(精选图片模式)
en: Show Original Image on Home Page (Recommended Image Mode)
ja: ホームページでオリジナル画像を表示するかどうか（おすすめ画像モード）
zh_tw: 首頁是否顯示原圖(精選圖片模式)

# Preferences.enableMaxWidthLimit
source: 预览图最大尺寸限制开关
en: Enable Maximum Width Limit for Preview Images
ja: プレビュー画像の最大サイズ制限スイッチ
zh_tw: 預覽圖最大尺寸限制開關

# Preferences.favicon
source: 请输入 favicon 地址
en: Please enter the favicon URL.
ja: favicon の URL を入力してください
zh_tw: 請輸入 favicon 地址

# Preferences.indexThemeSelect
source: 选择首页主题
en: Select Home Page Theme
ja: トップページテーマを選択
zh_tw: 選擇首頁主題

# Preferences.inputAdminImagesPerPage
source: 请输入每页显示的图片数量
en: Enter images per page for admin interface
ja: 管理画面の1ページあたりの画像表示数を入力してください
zh_tw: 請輸入每頁顯示的圖片數量

# Preferences.inputFeedId
source: 请输入 RSS feedId
en: Please enter the RSS feed ID.
ja: RSS feedId を入力してください
zh_tw: 請輸入 RSS feedId

# Preferences.inputMaxUploadFiles
source: 请输入最大上传文件数量
en: Please enter the maximum number of files that can be uploaded
ja: 最大アップロードファイル数を入力してください
zh_tw: 請輸入最大上傳檔案數量

# Preferences.inputMaxWidth
source: 请输入预览图最大宽度限制，正整数
en: Please enter the maximum width limit for preview images, a positive integer.
ja: プレビュー画像の最大幅制限を入力してください、正の整数
zh_tw: 請輸入預覽圖最大寬度限制，正整數

# Preferences.inputPreviewQuality
source: 请输入预览图压缩质量
en: Please enter the preview image compression quality.
ja: プレビュー画像圧縮品質を入力してください
zh_tw: 請輸入預覽圖壓縮品質

# Preferences.inputUserId
source: 请输入 RSS userId
en: Please enter the RSS user ID.
ja: RSS userId を入力してください
zh_tw: 請輸入 RSS userId

# Preferences.inputWebAuthor
source: 请输入网站归属者名称。
en: Please enter the website author name.
ja: ウェブサイト作者名を入力してください。
zh_tw: 請輸入網站歸屬者名稱。

# Preferences.inputWebSiteTitle
source: 请输入网站标题。
en: Please enter the website title.
ja: ウェブサイトタイトルを入力してください。
zh_tw: 請輸入網站標題。

# Preferences.maxUploadFiles
source: 最大上传文件数量
en: Maximum Upload Files
ja: 最大アップロードファイル数
zh_tw: 最大上傳檔案數量

# Preferences.maxWidth
source: 预览图最大宽度(正整数)
en: Maximum Width for Preview Images (positive integer)
ja: プレビュー画像の最大幅（正の整数）
zh_tw: 預覽圖最大寬度(正整數)

# Preferences.previewQuality
source: 预览图压缩质量 (0-1]
en: Preview Image Compression Quality (0-1]
ja: プレビュー画像圧縮品質 (0-1]
zh_tw: 預覽圖壓縮品質 (0-1]

# Preferences.webAuthor
source: 网站归属者名称
en: Website Author Name
ja: ウェブサイト作者名
zh_tw: 網站歸屬者名稱

# Preferences.webSiteTitle
source: 网站标题
en: Website Title
ja: ウェブサイトタイトル
zh_tw: 網站標題

# Theme.indexDefaultStyle
source: 默认
en: Default
ja: 既定
zh_tw: 預設

# Theme.indexPolaroidStyle
source: 宝丽来
en: Polaroid
ja: ポラロイド
zh_tw: 寶麗來

# Theme.indexSimpleStyle
source: 单列
en: Single Column
ja: 単列
zh_tw: 單欄

# Tips.addFailed
source: 添加失败！
en: Add failed!
ja: 追加に失敗しました！
zh_tw: 添加失敗！

# Tips.addSuccess
source: 添加成功！
en: Add successful!
ja: 追加に成功しました！

# Tips.completeSetup
source: 完成设置
en: Complete Setup
ja: 設定を完了
zh_tw: 完成設置

# Tips.confirmRemoveTwoFactor
source: 确定要移除双因素验证？
en: Are you sure you want to remove two-factor authentication?
ja: 二要素認証を削除してもよろしいですか？
zh_tw: 確定要移除雙因素驗證？

# Tips.congratulations
source: 恭喜!
en: Congratulations!
ja: おめでとう!

# Tips.copyImageFailed
source: 复制图片链接失败！
en: Failed to copy image link!
ja: 画像リンクのコピーに失敗しました！
zh_tw: 複製圖片連結失敗！

# Tips.copyImageSuccess
source: 复制图片链接成功！
en: Image link copied successfully!
ja: 画像リンクのコピーに成功しました！
zh_tw: 複製圖片連結成功！

# Tips.copyShareFailed
source: 复制分享直链失败！
en: Failed to copy share link!
ja: 共有リンクのコピーに失敗しました！
zh_tw: 複製分享直鏈失敗！

# Tips.copyShareSuccess
source: 复制分享直链成功！
en: Share link copied successfully!
ja: 共有リンクのコピーに成功しました！
zh_tw: 複製分享直鏈成功！

# Tips.deleteFailed
source: 删除失败！
en: Delete failed!
ja: 削除に失敗しました！
zh_tw: 刪除失敗！

# Tips.deleteSuccess
source: 删除成功！
en: Delete successful!
ja: 削除に成功しました！
zh_tw: 刪除成功！

# Tips.downloadAnyApp
source: 下载任意两步验证手机应用：
en: Download any two-step verification mobile app:
ja: 任意の二段階認証モバイルアプリをダウンロード：
zh_tw: 下載任意兩步驗證手機應用：

# Tips.downloadFailed
source: 下载失败！
en: Download failed!
ja: ダウンロードに失敗しました！
zh_tw: 下載失敗！

# Tips.downloadLicense
source: 图片版权归作者所有, 分享转载需遵循 {{license}} 许可协议！
en: Image copyright belongs to the author, sharing and reprinting must follow the {{license}} license agreement!
ja: 画像の著作権は作者に帰属し、共有・転載は {{license}} ライセンスに従う必要があります！
zh_tw: 圖片版權歸作者所有, 分享轉載需遵循 {{license}} 許可協議！

# Tips.downloadStart
source: 开始下载，原图较大，请耐心等待！
en: Starting download, the original image is large, please be patient!
ja: ダウンロードを開始します。元の画像は大きいので、お待ちください！
zh_tw: 開始下載，原圖較大，請耐心等待！

# Tips.enterSixDigits
source: 输入手机应用上的6位数字：
en: Enter the 6-digit number from your mobile app:
ja: モバイルアプリから6桁の数字を入力：
zh_tw: 輸入手機應用上的6位數字：

# Tips.getFailed
source: 获取失败
en: Failed to get
ja: 取得に失敗しました
zh_tw: 獲取失敗

# Tips.gettingOpenListDirs
source: 正在获取 Open List 挂载目录
en: Getting Open List mount directories
ja: Open List マウントディレクトリを取得中
zh_tw: 正在獲取 Open List 掛載目錄

# Tips.imageHeightRequired
source: 图片高度不能为空且必须大于 0！
en: Image height cannot be empty and must be greater than 0!
ja: 画像の高さは空にできず、0より大きい必要があります！
zh_tw: 圖片高度不能為空且必須大於 0！

# Tips.imageLoadFailed
source: 原图加载失败
en: Load image failed
ja: 画像の読み込みに失敗しました
zh_tw: 原圖加載失敗

# Tips.imageWidthRequired
source: 图片宽度不能为空且必须大于 0！
en: Image width cannot be empty and must be greater than 0!
ja: 画像の幅は空にできず、0より大きい必要があります！
zh_tw: 圖片寬度不能為空且必須大於 0！

# Tips.loading
source: 加载中...
en: Loading...
ja: 読み込み中...
zh_tw: 載入中...

# Tips.noImg
source: 暂无图片
en: No images
ja: 画像がありません
zh_tw: 暫無圖片

# Tips.orEnterSecret
source: 或者输入秘钥：
en: Or enter the secret key:
ja: またはシークレットキーを入力：
zh_tw: 或者輸入秘鑰：

# Tips.reallyDelete
source: 确定删除？
en: Are you sure you want to delete?
ja: 本当に削除しますか？
zh_tw: 確定刪除？

# Tips.regenerate
source: 重新获取
en: Regenerate
ja: 再生成
zh_tw: 重新獲取

# Tips.removeFailed
source: 移除失败！
en: Removal failed!
ja: 削除に失敗しました！
zh_tw: 移除失敗！

# Tips.removeSuccess
source: 移除成功！
en: Removed successfully!
ja: 削除に成功しました！

# Tips.saveFailed
source: 保存失败
en: Save failed
ja: 保存に失敗しました
zh_tw: 儲存失敗

# Tips.saveSuccess
source: 保存成功
en: Saved successfully
ja: 保存に成功しました
zh_tw: 儲存成功

# Tips.scanQRCode
source: 使用手机应用扫描二维码：
en: Scan the QR code with your mobile app:
ja: モバイルアプリでQRコードをスキャン：
zh_tw: 使用手機應用掃描二維碼：

# Tips.selectAlbumFirst
source: 请先选择相册！
en: Please select an album first!
ja: アルバムを先に選択してください！
zh_tw: 請先選擇相簿！

# Tips.setupFailed
source: 设置失败！
en: Setup failed!
ja: 設定に失敗しました！
zh_tw: 設置失敗！

# Tips.setupSuccess
source: 设置成功！
en: Setup successful!
ja: 設定が成功しました！
zh_tw: 設置成功！

# Tips.stepOne
source: 第一步
en: Step One
ja: ステップ1

# Tips.stepThree
source: 第三步
en: Step Three
ja: ステップ3

# Tips.stepTwo
source: 第二步
en: Step Two
ja: ステップ2

# Tips.syncingStatus
source: 同步状态中...
en: Syncing status...
ja: 状態を同期中...
zh_tw: 同步狀態中...

# Tips.tokenIssuanceFailed
source: 令牌颁发失败！
en: Token issuance failed!
ja: トークンの発行に失敗しました！
zh_tw: 令牌頒發失敗！

# Tips.twoFactorEnabled
source: 双因素验证已启用
en: Two-factor authentication is enabled
ja: 二要素認証が有効になっています
zh_tw: 雙因素驗證已啟用

# Tips.updateFailed
source: 更新失败！
en: Update failed!
ja: 更新に失敗しました！
zh_tw: 更新失敗！

# Tips.updateSuccess
source: 更新成功！
en: Update successful!
ja: 更新に成功しました！

# Tips.uploadFileFirst
source: 请先上传文件！
en: Please upload a file first!
ja: ファイルを先にアップロードしてください！
zh_tw: 請先上傳檔案！

# Tips.webglUnavailable
source: WebGL 不可用，使用备用模式
en: WebGL unavailable, using fallback mode
ja: WebGLが利用できません。フォールバックモードを使用しています
zh_tw: WebGL 不可用，使用備用模式

# Tips.yes
source: 是的
en: Yes
ja: はい

# Tips.zoomHint
source: 滚动或捏合缩放，拖动平移，双击切换大小
en: Scroll or pinch to zoom, drag to pan, double-click to toggle size
ja: スクロールまたはピンチでズーム、ドラッグで移動、ダブルクリックでサイズ切替
zh_tw: 滾動或捏合縮放，拖動平移，雙擊切換大小

# Upload.detail
source: 描述
en: Description
ja: 説明

# Upload.height
source: 图片高度 px
en: Image Height px
ja: 画像高さ px
zh_tw: 圖片高度 px

# Upload.indexTag
source: 请输入图片索引标签，如：猫猫，不要输入特殊字符。
en: Please enter image index tag, e.g., cat, do not enter special characters.
ja: 画像インデックスタグを入力してください。例：猫、特殊文字は入力しないでください。
zh_tw: 請輸入圖片索引標籤，如：貓貓，不要輸入特殊字符。

# Upload.inputDetail
source: 请输入描述
en: Please enter description
ja: 説明を入力してください
zh_tw: 請輸入描述

# Upload.inputLat
source: 输入纬度
en: Enter Latitude
ja: 緯度を入力
zh_tw: 輸入緯度

# Upload.inputLon
source: 输入经度
en: Enter Longitude
ja: 経度を入力
zh_tw: 輸入經度

# Upload.inputTitle
source: 输入图片标题
en: Enter Image Title
ja: 画像タイトルを入力
zh_tw: 輸入圖片標題

# Upload.lat
source: 纬度
en: Latitude
ja: 緯度
zh_tw: 緯度

# Upload.livephoto
source: LivePhoto 上传
en: LivePhoto Upload
ja: LivePhoto アップロード
zh_tw: LivePhoto 上傳

# Upload.lon
source: 经度
en: Longitude
ja: 経度
zh_tw: 經度

# Upload.manualUpload
source: 手动上传
en: Manual Upload
ja: 手動アップロード
zh_tw: 手動上傳

# Upload.multiple
source: 多文件上传
en: Multiple Files Upload
ja: 複数ファイルアップロード
zh_tw: 多檔案上傳

# Upload.openListDirectory
source: Open List 目录
en: Open List directory
ja: Open List ディレクトリ
zh_tw: Open List 目錄

# Upload.previewUrl
source: 预览图片地址
en: Preview Image URL
ja: プレビュー画像URL
zh_tw: 預覽圖片地址

# Upload.selectAlbum
source: 请选择相册
en: Please select album
ja: アルバムを選択してください
zh_tw: 請選擇相簿

# Upload.selectOpenListDirectory
source: 请选择 Open List 目录
en: Please select Open List directory
ja: Open List ディレクトリを選択してください
zh_tw: 請選擇 Open List 目錄

# Upload.selectStorage
source: 请选择存储
en: Please select storage
ja: ストレージを選択してください
zh_tw: 請選擇儲存

# Upload.selectUploadMode
source: 请选择上传方式，默认单文件上传
en: Please select upload mode, default is single file upload
ja: アップロード方法を選択してください。デフォルトは単一ファイルアップロードです。
zh_tw: 請選擇上傳方式，默認單檔案上傳

# Upload.simple
source: 单文件上传
en: Single File Upload
ja: 単一ファイルアップロード
zh_tw: 單檔案上傳

# Upload.title
source: 图片标题
en: Image Title
ja: 画像タイトル
zh_tw: 圖片標題

# Upload.uploadError
source: 上传失败
en: upload error
ja: アップロードに失敗しました
zh_tw: 上傳失敗

# Upload.uploadSuccess
source: 上传成功
en: upload success
ja: アップロードに成功しました
zh_tw: 上傳成功

# Upload.uploadTips1
source: 点击上传文件或拖拽文件到这里
en: Click to upload file or drag file here
ja: クリックしてファイルをアップロードするか、ここにファイルをドラッグ＆ドロップしてください
zh_tw: 點擊上傳檔案或拖拽檔案到這裡

# Upload.uploadTips2
source: Vercel 等平台 Free 订阅限制上传大小 6M。
en: Vercel and other platforms Free subscription limit upload size to 6M.
ja: Vercel などのプラットフォームの無料サブスクリプションでは、アップロードサイズが6Mに制限されています。
zh_tw: Vercel 等平台 Free 訂閱限制上傳大小 6M。

# Upload.uploadTips3
source: 上传 LivePhoto 视频
en: Upload LivePhoto video
ja: LivePhoto ビデオをアップロード
zh_tw: 上傳 LivePhoto 視頻

# Upload.uploadTips4
source: 单次最多可上传 {count} 个文件
en: Maximum {count} files can be uploaded at once
ja: 一度に最大 {count} ファイルまでアップロード可能
zh_tw: 單次最多可上傳 {count} 個檔案

# Upload.uploading
source: 上传中...
en: uploading...
ja: アップロード中...
zh_tw: 上傳中...

# Upload.url
source: 图片地址
en: Image URL
ja: 画像URL
zh_tw: 圖片地址

# Upload.videoUrl
source: LivePhoto 视频地址
en: LivePhoto Video URL
ja: LivePhoto ビデオURL
zh_tw: LivePhoto 視頻地址

# Upload.width
source: 图片宽度 px
en: Image Width px
ja: 画像幅 px
zh_tw: 圖片寬度 px

# Words.album
source: 相册
en: Album
ja: アルバム
zh_tw: 相簿

# Words.all
source: 全部
en: All
ja: すべて

# Words.camera
source: 相机
en: Camera
ja: カメラ
zh_tw: 相機

# Words.default
source: 默认
en: Default
ja: デフォルト
zh_tw: 預設

# Words.lens
source: 镜头
en: Lens
ja: レンズ
zh_tw: 鏡頭

# Words.private
source: 未公开
en: Private
ja: 非公開
zh_tw: 未公開

# Words.public
source: 已公开
en: Public
ja: 公開済み
zh_tw: 已公開

# Words.showStatus
source: 公开状态
en: Show Status
ja: 表示状態
zh_tw: 公開狀態

# Words.sort
source: 排序
en: Sort
ja: ソート

# Words.storage
source: 存储
en: Storage
ja: ストレージ
zh_tw: 儲存

# Words.type
source: 类型
en: Type
ja: タイプ
zh_tw: 類型
